
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	 УстановитьПривилегированныйРежим(Истина);
        
        Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
        
        Если Не Пользователь = Неопределено Тогда
            
            Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
            
            Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
                Настройка = Новый НастройкиКлиентскогоПриложения;
            КонецЕсли;
            
            Настройка.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
            ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройка,, Пользователь.Имя);
            
        КонецЕсли;

КонецПроцедуры
