
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Цели
	Движения.Цели.Записывать = Истина;
	Для Каждого ТекСтрокаЦели Из Цели Цикл
		Движение = Движения.Цели.Добавить();
		Движение.Период = Дата;
		Движение.Спортсмен = Спортсмен;
		Движение.Упражнение = ТекСтрокаЦели.Упражнение;
		Движение.Количество = ТекСтрокаЦели.Количество;
		Движение.Нагрузка = ТекСтрокаЦели.Нагрузка;
		Движение.Время = ТекСтрокаЦели.Время;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
