
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для н=0 по Объект.НагружаемыеГруппыМышц.Количество()-1 Цикл
		Строка = Объект.НагружаемыеГруппыМышц[н];
		
		ЭлементГруппа = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование,Тип("ГруппаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки]);
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ЭлементГруппа.отображатьЗаголовок = Ложь;

				
		ЭлементОтображенияДанных = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование,Тип("ДекорацияФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементОтображенияДанных.Вид = ВидДекорацииФормы.Надпись;
		ЭлементОтображенияДанных.Заголовок = Строка.ГруппаМышц.Наименование;
		
			//Добавляем саму кнопку
		ЭлементКнопка = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование+"Изменить", Тип("КнопкаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементКнопка.ИмяКоманды = "ИзменитьГруппуМышц"; 
		ЭлементКнопка.Заголовок = "Изменить";
	
			
		ЭлементКнопка = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование+"Удалить", Тип("КнопкаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементКнопка.ИмяКоманды = "УдалитьГруппуМышц"; 
		ЭлементКнопка.Заголовок = "Удалить";
		//ЭлементКнопка.Картинка = БиблиотекаКартинок.Удалить;
		//ЭлементКнопка.Отображение = ОтображениеКнопки.Картинка;

	КонецЦикла;		

	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для н=1 по 7 Цикл
		Элементы["Тренировка"+н].Видимость =  н<=Объект.КоличествоТренировочныхДней ;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТренировочныхДнейПриИзменении(Элемент)
	Для н=1 по 7 Цикл
		Элементы["Тренировка"+н].Видимость =  н<=Объект.КоличествоТренировочныхДней ;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьГруппуМышц(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьГруппуМышц(Команда)
	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуМышц(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
