
&НаКлиенте
Процедура ВидУпражненийПриИзменении(Элемент)
	СобратьНаименование();
	
КонецПроцедуры


&НаКлиенте
Процедура СобратьНаименование()
	Объект.Наименование = ""+ Объект.ВидУпражнений+?(ЗначениеЗаполнено(Объект.Стиль)," ("+НРег(Объект.Стиль)+") ","")+НРег(Объект.Дисциплина);	
КонецПроцедуры

&НаКлиенте
Процедура СтильПриИзменении(Элемент)
	СобратьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	СобратьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидСпортаПриИзменении(Элемент)
	СобратьНаименование();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементОтбора = ВоздействиеНаМыщцы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Упражнение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеКартинки");
КонецПроцедуры

&НаКлиенте
Процедура ВоздействиеНаМышцыСоздать(Команда)
	ПараметрыДокументов = Новый Структура("Упражнение", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.МышцыЗадействованныеВУпражнениях.ФормаЗаписи", ПараметрыДокументов, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлКартинки(Команда)
	Оповещение  = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	
	НачатьПомещениеФайла(Оповещение,,, Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если не Результат Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаКартинку = Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		ТекущийОбъект.ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаКартинку));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если ЗначениеЗаполнено(СсылкаНаКартинку) Тогда
	//	УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
	//	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ДанныеКартинки"); 
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКартинкуНаСервере()
	ОбъектСДанными = РеквизитФормыВЗначение("Объект"); 
	ОбъектСДанными.ДанныеКартинки = Неопределено; 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(Команда)
	ОчиститьКартинкуНаСервере();
КонецПроцедуры
